{
   "bitcoin": {
      "description": "The first decentralized peer-to-peer payment network in which encryption techniques are used to regulate the generation of units of currency and verify the transfer of funds, all operating independently of a central bank.",
      "website": "https://bitcoin.org/en/",
      "paper": "https://bitcoin.org/bitcoin.pdf",
      "github": "https://github.com/bitcoin"
   },
   "bitcoin-cash": {
      "description": "A decentralized peer-to-peer payment network that came into existence as a result of a hard fork from the original bitcoin blockchain. Bitcoin Cash emerged after some of the leading backers disagreed on how to take Bitcoin further and are utilizing a new proposal that consists of a new transaction type and an increase in block limit size.",
      "website": "",
      "paper": "",
      "github": ""
   },
   "bitcoin-gold": {
      "description": "A hard-fork of the original Bitcoin blockchain, Bitcoin Gold aims to implement features with a new proof-of-work algorithm that allow for further decentralization and replay protection.",
      "website": "https://bitcoingold.org/",
      "paper": "",
      "github": "https://github.com/BTCGPU/BTCGPU"
   },
   "ethereum": {
      "description": "An open-source, public, blockchain-based computing platform that enables developers to build and deploy decentralized applications. Ether (ETH), the crypto token that fuels the Ethereum network acts as a tradeable cryptocurrency and is used to pay for transaction fees and services on the network.",
      "website": "https://www.ethereum.org/",
      "paper": "https://github.com/ethereum/wiki/wiki/White-Paper",
      "github": "https://github.com/ethereum"
   },
   "ripple": {
      "description": "Both a digital currency (XRP) and a distributed real-time payment protocol within which that currency is transferred. Ripple's distributed technology aims to enable banks to send real-time international payments across networks; to meet growing demands for faster, low-cost, on-demand global payment services.",
      "website": "https://ripple.com/",
      "paper": "https://ripple.com/files/ripple_consensus_whitepaper.pdf",
      "github": "https://github.com/ripple"
   },
   "litecoin": {
      "description": "An open-source peer-to-peer cryptocurrency that uses the scrypt proof of work algorithm as opposed to Bitcoin's hashing algorithm. Litecoin was originally created to improve upon Bitcoin by speeding up transaction confirmations.",
      "website": "https://litecoin.org/",
      "paper": "",
      "github": "https://github.com/litecoin-project"
   },
   "ethereum-classic": {
      "description": "An open-source, blockchain-based computing platform that came into existence as a result of the DAO hard-fork. Identical to Ethereum up to a certain block (block 1920000), Ethereum Classic consolidated members of the Ethereum community who rejected the fork.",
      "website": "https://ethereumclassic.github.io/",
      "paper": "https://coss.io/documents/white-papers/ethereum-classic.pdf",
      "github": "https://github.com/ethereumclassic"
   },
   "dash": {
      "description": "An open-source peer-to-peer cryptocurrency that offers all the features of Bitcoin as well as other capabilities which include private transactions, instant transactions and decentralized governance.",
      "website": "https://www.dash.org/",
      "paper": "https://www.dash.org/wp-content/uploads/2015/04/Dash-WhitepaperV1.pdf",
      "github": "https://github.com/dashpay"
   },
   "nem": {
      "description": "A peer-to-peer cryptocurrency (XEM) and blockchain platform that has introduced new features in blockchain technology through its proof-of-importance (POI) algorithm, encrypted messaging system, multisignature accounts and Eigentrust++ reputation system.",
      "website": "https://www.nem.io/",
      "paper": "https://www.nem.io/NEM_techRef.pdf",
      "github": "https://github.com/NemProject"
   },
   "iota": {
      "description": "A new transactional settlement and data integrity layer for the Internet of Things. IOTA is based on a new distributed ledger architecture which aims to overcome inefficiencies of current Blockchain designs to introduce a new way of reaching peer-to-peer consensus.",
      "website": "https://iota.org/",
      "paper": "https://iota.org/IOTA_Whitepaper.pdf",
      "github": "https://github.com/iotaledger"
   },
   "monero": {
      "description": "An open-source cryptocurrency that is heavily focused on privacy, decentralisation and scalability. Monero is based on the CryptoNote protocol and has significant algorithmic differences to Bitcoin.",
      "website": "https://getmonero.org/",
      "paper": "",
      "github": "https://github.com/monero-project"
   },
   "eos": {
      "description": "Software that introduces a new blockhain architecture designed to enable vertical and horizontal scaling of decentralized applications with the aim of quick and easy deployment, scalability to millions of transactions per second and elimination of user fees.",
      "website": "https://eos.io/",
      "paper": "https://github.com/EOSIO/Documentation/blob/master/TechnicalWhitePaper.md",
      "github": "https://github.com/EOSIO"
   },
   "stratis": {
      "description": "A Blockchain-as-a-service (BaaS) Platform that allows corporations in the financial sector to create their custom blockchain applications with the features they require. Stratis currency (STRAT), the native currency within the platform, will be needed to create and fuel these blockchains.",
      "website": "https://stratisplatform.com/",
      "paper": "https://stratisplatform.com/files/Stratis_Whitepaper.pdf",
      "github": "https://github.com/stratisproject"
   },
   "bitshares": {
      "description": "BitShares offers a stack of financial services which include enabling an open, scalable decentralized exchange as well as banking on a blockchain. Built to be fast, efficient and scalable to handle tens of thousands of transactions per second that happen on a decentralized exchange.",
      "website": "https://bitshares.org/",
      "paper": "http://docs.bitshares.org/bitshares/papers/index.html",
      "github": "https://github.com/bitshares"
   },
   "bitconnect": {
      "description": "A community driven open-source cryptocurrency that allows BitConnect holders to receive interest due to helping maintain the security of the network.",
      "website": "https://bitconnectcoin.co/",
      "paper": "",
      "github": "https://github.com/bitconnectcoin"
   },
   "tether": {
      "description": "The Tether platform is built on top of open blockchain technologies to allow users to convert fiat cash to digital currency. This is done by tethering the value of the cryptocurrency to the price of national currencies - US Dollar, the Euro and the Yen.",
      "website": "https://tether.to/",
      "paper": "https://bravenewcoin.com/assets/Whitepapers/Tether-White-Paper.pdf",
      "github": ""
   },
   "zcash": {
      "description": "The first permissionless cryptocurrency that aims to fully protect the privacy of transactions by hiding the sender, recipient and value on the blockchain.",
      "website": "https://z.cash/",
      "paper": "http://zerocash-project.org/media/pdf/zerocash-extended-20140518.pdf",
      "github": "https://github.com/zcash"
   },
   "neo": {
      "description": "China's first original and open-source public blockchain. Initially known as Antshares, Neo aims to support multiple types of digital assets as well as allow users to establish smart contracts to enhance and enrich the functions of said digital assets.",
      "website": "https://neo.org/",
      "paper": "https://github.com/neo-project/neo/wiki/Whitepaper-1.1",
      "github": "https://github.com/neo-project"
   },
   "bytecoin-bcn": {
      "description": "Launched in 2012, Bytecoin is an untraceable cryptocurrency that launched in 2012 that offers fee-free instant international payments, secure funds and privacy.",
      "website": "https://bytecoin.org/",
      "paper": "https://cryptonote.org/whitepaper.pdf",
      "github": "https://github.com/amjuarez/bytecoin"
   },
   "veritaseum": {
      "description": "A smart contracts-based, peer-to-peer wallet interface (in beta) that currently interacts with Bitcoin blockchain and is to be ported to Ethereum. Veritaseum aims to allow non-technical individuals & entities to quickly create, enter and manage smart contracts directly with others without an authoritative 3rd party.",
      "website": "http://veritas.veritaseum.com/",
      "paper": "",
      "github": "https://github.com/veritaseum"
   },
   "steem": {
      "description": "An incentivized, blockchain-based social media platform where users can earn the digital currency (STEEM) by upvoting, posting and sharing content.",
      "website": "https://steem.io/",
      "paper": "https://steem.io/SteemWhitePaper.pdf",
      "github": "https://github.com/steemit"
   },
   "waves": {
      "description": "A decentralized blockchain platform focusing on custom blockchain tokens operations where token exchange facilitates fundraising, crowdfunding, and trading of financial instruments on the blockchain.",
      "website": "https://wavesplatform.com/",
      "paper": "https://blog.wavesplatform.com/waves-whitepaper-164dd6ca6a23",
      "github": "https://github.com/wavesplatform/"
   },
   "qtum": {
      "description": "The first digital currency that aims to allow Decentralized Applications and Smart Contracts to execute as part of an Unspent Transaction Output (UTXO), using a Proof-of-Stake model.",
      "website": "http://www.qtum.org/",
      "paper": "https://qtum.org/en/white-papers",
      "github": "https://github.com/qtumproject"
   }, 
   "iconomi": {
      "description": "Using Ethereum smart contracts, ICONOMI is a digital assets management platform that aims to provide a simple way for beginners and blockchain experts, to invest and manage their digital assets.",
      "website": "https://www.iconomi.net/",
      "paper": "https://coss.io/documents/white-papers/iconomi.pdf",
      "github": ""
   },
   "gnosis-gno": {
      "description": "Based on Ethereum, Gnosis is a decentralized prediction market platform that aims to disrupt some of the largest existing industries (insurance, financial services) in the near future.",
      "website": "https://gnosis.pm/",
      "paper": "https://gnosis.pm/resources/default/pdf/gnosis_whitepaper.pdf",
      "github": "https://github.com/gnosis"
   }, 
   "status": {
      "description": "A modular utility token that fuels the Status network - an open source messaging platform and mobile interface to interact with decentralized applications that run on the Ethereum Network.",
      "website": "https://status.im/",
      "paper": "https://status.im/whitepaper.pdf",
      "github": "https://github.com/status-im"
   },
   "siacoin": {
      "description": "Sia is a decentralized cloud storage platform that intends to compete with existing storage solutions, at both the P2P and enterprise level. Peers on Sia rent storage from each other while Sia itself stores only the storage contracts formed between parties.",
      "website": "http://sia.tech/",
      "paper": "https://www.sia.tech/whitepaper.pdf",
      "github": "https://github.com/NebulousLabs/Sia"
   },  
   "golem-network-tokens": {
      "description": "Golem project aims to create a global, open sourced, decentralized supercomputer in which producers may sell spare CPU time of their personal computers and consumers may acquire resources for computation-intensive tasks.",
      "website": "https://golem.network/",
      "paper": "http://golemproject.net/doc/DraftGolemProjectWhitepaper.pdf",
      "github": "https://github.com/golemfactory"
   }, 
   "stellar": {
      "description": "A platform that aims to facilitate moving currency quickly, reliably and almost no cost by connecting banks, payments systems and people through the Stellar network.",
      "website": "https://www.stellar.org/",
      "paper": "https://www.stellar.org/papers/stellar-consensus-protocol.pdf",
      "github": "https://github.com/stellar"
   },
   "cardano": {
      "description": "A decentralized blockchain application that aims to develop a research-driven smart contract platform as well as the digital currency named Ada.",
      "website": "https://www.cardanohub.org/en/home/",
      "paper": "https://www.cardanohub.org/en/academic-papers/",
      "github": "https://github.com/input-output-hk/cardano-sl/"
   },
   "undefined": {
      "description": "Hmmm. Though the price, circulating supply and market cap values are accurate - there doesn't appear to be any detailed data captured on this cryptocurrency. Should be updated in due time!",
      "website": "",
      "paper": "",
      "github": ""
   }
}